#include "pch.h"
#include "TestRegRecipe.h"
#include <EventAPI.h>
#include "TestDBStorage.h"
#include "TestCommandReg.h"
#include "EnumGenerator.h"
#include "TestNbt.h"

LARGE_INTEGER freq_;
auto INITPERFORMANCE = QueryPerformanceFrequency(&freq_);

LARGE_INTEGER begin_time;
LARGE_INTEGER end_time;
inline double ns_time()
{
    return (end_time.QuadPart - begin_time.QuadPart) * 1000000.0 / freq_.QuadPart;
}

#define TestTimeLog(func, ...)            \
    QueryPerformanceCounter(&begin_time); \
    func(__VA_ARGS__);                    \
    QueryPerformanceCounter(&end_time);   \
    logger.warn("  {}\t time: {}", #func, ns_time());

#ifdef ENABLE_TEST_DLSYM

inline void static_query()
{
    dlsym_static("?EVENT_BEGIN@ActorDefinitionIdentifier@@2V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@B");
    dlsym_static("?$TSS0@?1??value@?$type_index@V?$sigh_storage_mixin@V?$basic_storage@W4ObjectHandleValue@Scripting@@VScriptFoodComponent@@V?$allocator@VScriptFoodComponent@@@std@@X@entt@@@entt@@X@entt@@SAIXZ@4HA");
    dlsym_static("?$TSS0@?1???$type_id@VCommandRegistry@@W4Mode@ExecuteCommand@@@@YA?AV?$typeid_t@VCommandRegistry@@@@XZ@4HA");
    dlsym_static("?value@?1??0?$type_index@V?$sigh_storage_mixin@V?$basic_storage@W4ObjectHandleValue@Scripting@@VScriptMovementBasicComponent@@V?$allocator@VScriptMovementBasicComponent@@@std@@X@entt@@@entt@@X@entt@@SAIXZ@4IB");
    dlsym_static("?mCrimsonFence@VanillaBlocks@@3PEBVBlock@@EB");

    TestTimeLog(dlsym_call);
};

#include <filesystem>
#include <fstream>
#include "TestNbt.h"
void verifyHashUnique()
{
    std::vector<__int64> hashs;
    std::ifstream file("bedrock_server_SymList.txt");
    bool hasError = false;
    if (file.is_open())
    {
        std::string sym;
        while (std::getline(file, sym))
        {
            auto hash = do_hash2(sym);
            if (std::find(hashs.begin(), hashs.end(), hash) != hashs.end())
            {
                logger.error(sym);
                hasError = true;
            }
            hashs.push_back(hash);
        }
        logger.info("total symbol: {}", hashs.size());
        if (!hasError)
            logger.info("hash verify success");
    }
    else
    {
        logger.error("file \"{}\" not found, hash verify will not be executed", "bedrock_server_SymList.txt");
    }
};
#else
inline void testStaticDlsym(){};
inline void testMCAPI(){};
#endif // ENABLE_TEST_DLSYM
//#include <MC/ItemDescriptor.hpp>
void entry()
{
    logger.consoleLevel = logger.warn.level;
    logger.fileLevel = logger.info.level;
    // ItemDescriptor i1;
    // ItemDescriptor i2;
    // i1 = i2;
    Event::ServerStartedEvent::subscribe([](Event::ServerStartedEvent const& ev) -> bool {
        testRegRecipe();
        testStaticDlsym();
        testMCAPI();
        TestNbt::test();
        TestCommandReg::test();
        TestDBStorage::test();
        EnumGenerator::gen();
        // verifyHashUnique();
        return true;
    });
    Event::RegCmdEvent::subscribe([](Event::RegCmdEvent const& ev) -> bool {
#ifdef ENABLE_TEST_DBSTORAGE
        RemovePlayerCommand::setup(*ev.mCommandRegistry);
        DBTestCommand::setup(*ev.mCommandRegistry);
#endif // ENABLE_TEST_DBSTORAGE
#ifdef ENABLE_TEST_AI
        AiTest::setupCommand(*ev.mCommandRegistry);
#endif // ENABLE_TEST_AI
        return true;
    });
}

// namespace
//{
// bool isEdu = false;
// }
// TClasslessInstanceHook(bool, "?isEducationEditionLevel@LevelData@@QEBA_NXZ")
//{
//     return isEdu;
// }
// TClasslessInstanceHook(void, "?setupStandardServer@ServerCommands@@YAXAEAVMinecraft@@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@1PEAVPermissionsFile@@@Z",
//                        class Minecraft& mc, std::string const&a2, std::string const& a3, class PermissionsFile* a4)
//{
//     isEdu = true;
//     original(this, mc, a2, a3, a4);
//     isEdu = false;
// }

// TClasslessInstanceHook(void, "?updateServerAnnouncement@ServerNetworkHandler@@QEAAXXZ")
//{
//#ifdef DEBUG
//
//    auto v8 = *dAccess<voids<>*>(this, 13 * 8);
//    auto motd = dAccess<char*>(this, 632);
//    using Fn = void (*)(void*, char *, std::string const&, unsigned int, int, int, char);
//    auto v9 = dAccess<Fn>(&v8, 24);
//    auto v10 = dAccess<int>(this, 188 * 4);
//    std::string levelName = "TestName";
//    v9(&v8, motd, levelName, 1, 12, v10, 1);
//#endif // DEBUG
//    //original(this);
// }

#ifdef ABILITYPRO

#include <MC/ServerPlayer.hpp>
#include <MC/Level.hpp>

class Ability
{

public:
    enum Options : unsigned char;
    enum Type;

    Type mType;
    int mValue;
    Options mOptions;

    MCAPI bool getBool() const;
    MCAPI float getFloat() const;
    MCAPI enum Ability::Type getType() const;
    MCAPI void setBool(bool);
};

class Abilities
{

public:
    std::unique_ptr<class PermissionsHandler> mPermissions;
    std::array<Ability, 18> mAbilities;
    std::array<Ability, 8> mCustomAbilityCache;
    int unk320;
    int unk324;
    int unk328;

public:
    MCAPI Abilities(class Abilities const&);
    MCAPI Abilities();
    MCAPI void addSaveData(class CompoundTag&) const;
    MCAPI void forEachAbility(class std::function<void(class Ability&, char const*)> const&, enum Ability::Options);
    MCAPI class Ability& getAbility(enum AbilitiesIndex);
    MCAPI class Ability const& getAbility(enum AbilitiesIndex) const;
    MCAPI bool getBool(enum AbilitiesIndex) const;
    MCAPI enum CommandPermissionLevel getCommandPermissions() const;
    MCAPI class Ability const& getCustomAbilityFromCache(enum AbilitiesIndex) const;
    MCAPI class Ability& getCustomAbilityFromCache(enum AbilitiesIndex);
    MCAPI enum PlayerPermissionLevel getPlayerPermissions() const;
    MCAPI bool isFlying() const;
    MCAPI bool loadSaveData(class CompoundTag const&);
    MCAPI class Abilities& operator=(class Abilities const&);
    MCAPI void setAbility(enum AbilitiesIndex, bool);
    MCAPI void setAbilityDiff(enum AbilitiesIndex, bool, bool&);
    MCAPI void setCommandPermissions(enum CommandPermissionLevel);
    MCAPI void setPlayerPermissions(enum PlayerPermissionLevel);
    MCAPI ~Abilities();
    MCAPI static char const* getAbilityName(enum AbilitiesIndex);
    MCAPI static enum AbilitiesIndex nameToAbilityIndex(std::string const&);

protected:
private:
    MCAPI void _registerAbilities();
    MCAPI static class std::array<char const*, 18> ABILITY_NAMES;
    MCAPI static std::string const TAG;

public:
inline static class std::array<char const*, 18>& ABILITY_NAMES_ = Abilities::ABILITY_NAMES;
};

inline class Abilities* getPlayerAbilities(struct ActorUniqueID const& a0)
{
    class Abilities* (Level::*rv)(struct ActorUniqueID const&);
    *((void**)&rv) = dlsym("?getPlayerAbilities@Level@@UEAAPEAVAbilities@@AEBUActorUniqueID@@@Z");
    return (Global<Level>->*rv)(std::forward<struct ActorUniqueID const&>(a0));
}

enum class AdventureFlag : int
{
    FlagWorldImmutable = 1,
    SettingsFlagsNoPvM = 2,
    SettingsFlagsNoMvP = 4,
    SettingsFlagsUnused = 8,
    SettingsFlagsShowNameTags = 16,
    FlagAutoJump = 32,
    FlagAllowFlight = 64,
    FlagNoClip = 128,
    FlagWorldBuilder = 256,
    FlagFlying = 512,
    FlagMuted = 1024,
};

enum class ActionPermission : int
{
    Mine = 1,
	DoorsAndSwitches = 2,
	OpenContainers = 4,
	AttackPlayers = 8,
	AttackMobs = 16,
	Operator = 32,
	Teleport = 64,
	Build = 128,
	Default = 256,
};

enum class PermissionLevel : int
{
    Visitor,
    Menber,
    Operator,
    Custom,
};
struct AdventureSettings;
inline struct AdventureSettings& getAdventureSettings()
{
    struct AdventureSettings& (Level::*rv)();
    *((void**)&rv) = dlsym("?getAdventureSettings@Level@@UEAAAEAUAdventureSettings@@XZ");
    return (Global<Level>->*rv)();
}

#include <MC/Packet.hpp>
class AdventureSettingsPacket : public Packet
{
public:
    uint64_t mFlag;
    CommandPermissionLevel mCommandPermissionLevel;
    int mActionPermissions;
    PermissionLevel mPermissionLevel;
    int mCustomStoredPermissions;
    ActorUniqueID mUniqueId;

    /*0*/ virtual ~AdventureSettingsPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AdventureSettingsPacket(struct AdventureSettings const&, class Abilities const&, struct ActorUniqueID, bool);
};

#include <MC/NetworkItemStackDescriptor.hpp>
class AddPlayerPacket : public Packet
{
public:
    std::vector<struct ActorLink> mActorLinks;         // 48
    std::string mName;                                 // 72
    mce::UUID mUuid;                                   // 104
    ActorUniqueID mUniqueId;                           // 120
    ActorRuntimeID mRuntimeId;                         // 128
    std::string mPlatformOnlineId;                     // 136
    Vec3 mPosition;                                    // 168
    Vec3 mVelocity;                                    // 180
    float mPitch;                                      // 192
    float mYaw;                                        // 196
    float mHeadYaw;                                    // 200
    std::vector<std::unique_ptr<DataItem>> mDataItems; // 208, only for read
    Abilities mAbilities;                              // 232
    std::string mDeviceId;                             // 568
    enum BuildPlatform mBuildPlatform;                 // 600
    NetworkItemStackDescriptor mCarriedItem;           // 608
    SynchedActorData* mActorData;                      // 736
public:
    /*0*/ virtual ~AddPlayerPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AddPlayerPacket(class Player&);
    MCAPI AddPlayerPacket();
};
//TClasslessInstanceHook(void, "?sendToClient@LoopbackPacketSender@@UEAAXAEBVNetworkIdentifier@@AEBVPacket@@E@Z", 
//    NetworkIdentifier const& nid, Packet const& pkt, unsigned char subId)
//{
//    if (pkt.getId() == MinecraftPacketIds::AdventureSettings) {
//        auto& packet = (AdventureSettingsPacket&)pkt;
//        logger.error("noclip: {}", (bool)((int)packet.mFlag & (int)AdventureFlag::FlagNoClip));
//        __debugbreak();
//    }
//    original(this, nid, pkt, subId);
//}

enum AbilitiesIndex : unsigned short
{
