#include "pch.h"
#include "ActorDebugCommand.h"
#include <EventAPI.h>
#include <MC/ActorClassTree.hpp>
#include <MC/ActorDefinitionIdentifier.hpp>
#include <MC/AddActorBasePacket.hpp>
#include <MC/Attribute.hpp>
#include <MC/AttributeInstanceDelegate.hpp>
#include <MC/BinaryStream.hpp>
#include <MC/CommandUtils.hpp>
#include <MC/Dimension.hpp>
#include <MC/ExperienceOrb.hpp>
#include <MC/HashedString.hpp>
#include <MC/HealthAttributeDelegate.hpp>
#include <MC/ItemActor.hpp>
#include <MC/ItemStack.hpp>
#include <MC/Level.hpp>
#include <MC/LoopbackPacketSender.hpp>
#include <MC/NetworkItemStackDescriptor.hpp>
#include <MC/Packet.hpp>
#include <MC/ServerPlayer.hpp>
#include <MC/ProjectileComponent.hpp>
#include <MC/ReadOnlyBinaryStream.hpp>
#include <MC/ThrownTrident.hpp>
#include <MC/Util.hpp>
#include <MC/Villager.hpp>
#include <MC/VillagerV2.hpp>
#include <ScheduleAPI.h>
#include <MC/DataItem.hpp>
#include <MC/NetworkHandler.hpp>
#include <MC/NetworkIdentifier.hpp>
//#include <MC/AdventureSettingsPacket.hpp>
//#include <MC/Abilities.hpp>
//#include <MC/Ability.hpp>
//#include <MC/AddActorPacket.hpp>
//#include <MC/AddItemActorPacket.hpp>
//#include <MC/AddPaintingPacket.hpp>
//#include <MC/AddPlayerPacket.hpp>
//#include <MC/AttributeInstance.hpp>
//#include <MC/AttributeInstanceHandle.hpp>
//#include <MC/SynchedActorData.hpp>


enum class ActorCategory2 : int
{
    mBoat = 0x20000,
    mNone = 0x0,
    mWaterAnimal = 0x30,
    mWater = 0x20,
    mUndead = 0x4000,
    mPlayer = 0x1,
    mAnimal = 0x10,
    mMob = 0x2,
    mMonster = 0x4,
    mPathable = 0x40,
    mHumanoid = 0x8,
    mTamable = 0x80,
    mRidable = 0x100,
    mItem = 0x400,
    mAmbient = 0x800,
    mVillager = 0x1000,
    mArthropod = 0x2000,
    mZombie = 0x8000,
    mMinecart = 0x10000,
    mBoatrideable = 0x20100,
    mMinecartRidable = 0x10100,
    mHumanoidMonster = 0xC,
    mTamableAnimal = 0x90,
    mUndeadMob = 0x4004,
    mZombieMonster = 0x8004,
};

enum class ActorType2 : int
{
    Item = 0x40,                     // minecraft:item,                   翻译: 物品
    Tnt = 0x41,                      // minecraft:tnt,                    翻译: TNT 方块
    FallingBlock = 0x42,             // minecraft:falling_block,          翻译: 下落的方块
    MovingBlock = 0x43,              // minecraft:moving_block,           翻译: 移动中的方块
    XpOrb = 0x45,                    // minecraft:xp_orb,                 翻译: 经验球
    EyeOfEnderSignal = 0x46,         // minecraft:eye_of_ender_signal,    翻译: 末影之眼
    EnderCrystal = 0x47,             // minecraft:ender_crystal,          翻译: 末影水晶
    FireworksRocket = 0x48,          // minecraft:fireworks_rocket,       翻译: 焰火火箭
    FishingHook = 0x4D,              // minecraft:fishing_hook,           翻译: 鱼钩
    Chalkboard = 0x4E,               // minecraft:chalkboard,             翻译: entity.chalkboard.name
    Painting = 0x53,                 // minecraft:painting,               翻译: 画
    LeashKnot = 0x58,                // minecraft:leash_knot,             翻译: 拴绳结
    Boat = 0x5A,                     // minecraft:boat,                   翻译: 船
    LightningBolt = 0x5D,            // minecraft:lightning_bolt,         翻译: 闪电
    AreaEffectCloud = 0x5F,          // minecraft:area_effect_cloud,      翻译: 区域效果云雾
    Balloon = 0x6B,                  // minecraft:balloon,                翻译: entity.balloon.name
    Shield = 0x75,                   // minecraft:shield,                 翻译: entity.shield.name
    Npc = 0x0133,                    // minecraft:npc,                    翻译: entity.npc.name
    Agent = 0x0138,                  // minecraft:agent,                  翻译: entity.agent.name
    ArmorStand = 0x013D,             // minecraft:armor_stand,            翻译: 盔甲架
    TripodCamera = 0x013E,           // minecraft:tripod_camera,          翻译: 三脚架摄像机
    Player = 0x013F,                 // minecraft:player,                 翻译: entity.player.name
    Bee = 0x017A,                    // minecraft:bee,                    翻译: 蜜蜂
    Piglin = 0x017B,                 // minecraft:piglin,                 翻译: 猪灵
    PiglinBrute = 0x017F,            // minecraft:piglin_brute,           翻译: 残暴猪灵
    IronGolem = 0x0314,              // minecraft:iron_golem,             翻译: 铁傀儡
    SnowGolem = 0x0315,              // minecraft:snow_golem,             翻译: 雪傀儡
    WanderingTrader = 0x0376,        // minecraft:wandering_trader,       翻译: 流浪商人
    Creeper = 0x0B21,                // minecraft:creeper,                翻译: 爬行者
    Slime = 0x0B25,                  // minecraft:slime,                  翻译: 史莱姆
    Enderman = 0x0B26,               // minecraft:enderman,               翻译: 末影人
    Ghast = 0x0B29,                  // minecraft:ghast,                  翻译: 恶魂
    MagmaCube = 0x0B2A,              // minecraft:magma_cube,             翻译: 岩浆怪
    Blaze = 0x0B2B,                  // minecraft:blaze,                  翻译: 烈焰人
    Witch = 0x0B2D,                  // minecraft:witch,                  翻译: 女巫
    Guardian = 0x0B31,               // minecraft:guardian,               翻译: 守卫者
    ElderGuardian = 0x0B32,          // minecraft:elder_guardian,         翻译: 远古守卫者
    EnderDragon = 0x0B35,            // minecraft:ender_dragon,           翻译: 末影龙
    Shulker = 0x0B36,                // minecraft:shulker,                翻译: 潜影贝
    Vindicator = 0x0B39,             // minecraft:vindicator,             翻译: 卫道士
    Ravager = 0x0B3B,                // minecraft:ravager,                翻译: 劫掠兽
    EvocationIllager = 0x0B68,       // minecraft:evocation_illager,      翻译: 唤魔者
    Vex = 0x0B69,                    // minecraft:vex,                    翻译: 恼鬼
    Pillager = 0x0B72,               // minecraft:pillager,               翻译: 掠夺者
    ElderGuardianGhost = 0x0B78,     // minecraft:elder_guardian_ghost,   翻译: entity.elder_guardian_ghost.name
    Chicken = 0x130A,                // minecraft:chicken,                翻译: 鸡
    Cow = 0x130B,                    // minecraft:cow,                    翻译: 牛
    Pig = 0x130C,                    // minecraft:pig,                    翻译: 猪
    Sheep = 0x130D,                  // minecraft:sheep,                  翻译: 羊
    Mooshroom = 0x1310,              // minecraft:mooshroom,              翻译: 哞菇
    Rabbit = 0x1312,                 // minecraft:rabbit,                 翻译: 兔子
    PolarBear = 0x131C,              // minecraft:polar_bear,             翻译: 北极熊
    Llama = 0x131D,                  // minecraft:llama,                  翻译: 羊驼
    Turtle = 0x134A,                 // minecraft:turtle,                 翻译: 海龟
    Panda = 0x1371,                  // minecraft:panda,                  翻译: 熊猫
    Fox = 0x1379,                    // minecraft:fox,                    翻译: 狐狸
    Hoglin = 0x137C,                 // minecraft:hoglin,                 翻译: 疣猪兽
    Strider = 0x137D,                // minecraft:strider,                翻译: 炽足兽
    Goat = 0x1380,                   // minecraft:goat,                   翻译: 山羊
    Axolotl = 0x1382,                // minecraft:axolotl,                翻译: 美西螈
    Squid = 0x2311,                  // minecraft:squid,                  翻译: 鱿鱼
    Dolphin = 0x231F,                // minecraft:dolphin,                翻译: 海豚
    Pufferfish = 0x236C,             // minecraft:pufferfish,             翻译: 河豚
    Salmon = 0x236D,                 // minecraft:salmon,                 翻译: 鲑鱼
    Tropicalfish = 0x236F,           // minecraft:tropicalfish,           翻译: 热带鱼
    Cod = 0x2370,                    // minecraft:cod,                    翻译: 鳕鱼
    GlowSquid = 0x2381,              // minecraft:glow_squid,             翻译: 发光鱿鱼
    Wolf = 0x530E,                   // minecraft:wolf,                   翻译: 狼
    Ocelot = 0x5316,                 // minecraft:ocelot,                 翻译: 豹猫
    Parrot = 0x531E,                 // minecraft:parrot,                 翻译: 鹦鹉
    Cat = 0x534B,                    // minecraft:cat,                    翻译: 猫
    Bat = 0x8113,                    // minecraft:bat,                    翻译: 蝙蝠
    ZombiePigman = 0x010B24,         // minecraft:zombie_pigman,          翻译: 僵尸猪灵
    Wither = 0x010B34,               // minecraft:wither,                 翻译: 凋灵
    Phantom = 0x010B3A,              // minecraft:phantom,                翻译: 幻翼
    Zoglin = 0x010B7E,               // minecraft:zoglin,                 翻译: 僵尸疣猪兽
    Zombie = 0x030B20,               // minecraft:zombie,                 翻译: 僵尸
    ZombieVillager = 0x030B2C,       // minecraft:zombie_villager,        翻译: 僵尸村民
    Husk = 0x030B2F,                 // minecraft:husk,                   翻译: 尸壳
    Drowned = 0x030B6E,              // minecraft:drowned,                翻译: 溺尸
    ZombieVillagerV2 = 0x030B74,     // minecraft:zombie_villager_v2,     翻译: 怪人村民
    Spider = 0x040B23,               // minecraft:spider,                 翻译: 蜘蛛
    Silverfish = 0x040B27,           // minecraft:silverfish,             翻译: 蠹虫
    CaveSpider = 0x040B28,           // minecraft:cave_spider,            翻译: 洞穴蜘蛛
    Endermite = 0x040B37,            // minecraft:endermite,              翻译: 末影螨
    Minecart = 0x080054,             // minecraft:minecart,               翻译: 矿车
    HopperMinecart = 0x080060,       // minecraft:hopper_minecart,        翻译: 漏斗矿车
    TntMinecart = 0x080061,          // minecraft:tnt_minecart,           翻译: TNT 矿车
    ChestMinecart = 0x080062,        // minecraft:chest_minecart,         翻译: 运输矿车
    CommandBlockMinecart = 0x080064, // minecraft:command_block_minecart, 翻译: 命令方块矿车
    Skeleton = 0x110B22,             // minecraft:skeleton,               翻译: 骷髅
    Stray = 0x110B2E,                // minecraft:stray,                  翻译: 流浪者
    WitherSkeleton = 0x110B30,       // minecraft:wither_skeleton,        翻译: 凋灵骷髅
    Horse = 0x205317,                // minecraft:horse,                  翻译: 马
    Donkey = 0x205318,               // minecraft:donkey,                 翻译: 驴
    Mule = 0x205319,                 // minecraft:mule,                   翻译: 骡子
    SkeletonHorse = 0x215B1A,        // minecraft:skeleton_horse,         翻译: 骷髅马
    ZombieHorse = 0x215B1B,          // minecraft:zombie_horse,           翻译: 僵尸马
    XpBottle = 0x400044,             // minecraft:xp_bottle,              翻译: 附魔之瓶
    ShulkerBullet = 0x40004C,        // minecraft:shulker_bullet,         翻译: 潜影贝子弹
    DragonFireball = 0x40004F,       // minecraft:dragon_fireball,        翻译: 末影龙火球
    Snowball = 0x400051,             // minecraft:snowball,               翻译: 雪球
    Egg = 0x400052,                  // minecraft:egg,                    翻译: 鸡蛋
    Fireball = 0x400055,             // minecraft:fireball,               翻译: 火球
    SplashPotion = 0x400056,         // minecraft:splash_potion,          翻译: 药水
    EnderPearl = 0x400057,           // minecraft:ender_pearl,            翻译: 末影珍珠
    WitherSkull = 0x400059,          // minecraft:wither_skull,           翻译: 凋灵头颅
    WitherSkullDangerous = 0x40005B, // minecraft:wither_skull_dangerous, 翻译: 凋灵头颅
    SmallFireball = 0x40005E,        // minecraft:small_fireball,         翻译: 小火球
    LingeringPotion = 0x400065,      // minecraft:lingering_potion,       翻译: 滞留药水
    LlamaSpit = 0x400066,            // minecraft:llama_spit,             翻译: 羊驼口水
    EvocationFang = 0x400067,        // minecraft:evocation_fang,         翻译: 唤魔者尖牙
    IceBomb = 0x40006A,              // minecraft:ice_bomb,               翻译: entity.ice_bomb.name
    ThrownTrident = 0xC00049,        // minecraft:thrown_trident,         翻译: 三叉戟
    Arrow = 0xC00050,                // minecraft:arrow,                  翻译: 箭
    Villager = 0x0100030F,           // minecraft:villager,               翻译: 村民
    VillagerV2 = 0x01000373,         // minecraft:villager_v2,            翻译: 村民
};

std::string getActorFakeName(Actor* actor);

struct ActorMapping
{
    std::string mNameSpace;
    std::string mName;
    std::string mAlias;
    HashedString mMappingName;

public:
    MCAPI ActorMapping(std::string const&, std::string const&, std::string const&);
    MCAPI ActorMapping(std::string const&, std::string const&);
    MCAPI std::string getMappingName(enum ActorTypeNamespaceRules) const;
    MCAPI ~ActorMapping();
};

void testDataItem()
{
    // Test destructor of DataItem2
    std::string* str;
    {
        auto item = DataItem::create(1, fmt::format("{},{}", "0LoopbackPacketSender@@QEAA@EAEAVNetworkHandler@@@Z", "[02:16:08 Info][Item] ActorEventCoordinator::sendActorCarriedItemChanged actor: , previouslyCarriedItem: 0 x (0)@0, carriedItem: 1 x 弓(300)@0, hand: 0"));
        auto item2 = item->clone();
        ASSERT(item->isDataEqual(*item2));
        //ASSERT((*(uintptr_t**)item.get())[2] == (*(uintptr_t**)item2.get())[2]);
        str = &item->getData<std::string>();
        ASSERT(*str == "0LoopbackPacketSender@@QEAA@EAEAVNetworkHandler@@@Z,[02:16:08 Info][Item] ActorEventCoordinator::sendActorCarriedItemChanged actor: , previouslyCarriedItem: 0 x (0)@0, carriedItem: 1 x 弓(300)@0, hand: 0");
    }
    //logger.error(*str);
    ASSERT(*str != "0LoopbackPacketSender@@QEAA@EAEAVNetworkHandler@@@Z,[02:16:08 Info][Item] ActorEventCoordinator::sendActorCarriedItemChanged actor: , previouslyCarriedItem: 0 x (0)@0, carriedItem: 1 x 弓(300)@0, hand: 0");
    Schedule::delay([str]() {
        //logger.error(*str);
        ASSERT(*str != "0LoopbackPacketSender@@QEAA@EAEAVNetworkHandler@@@Z,[02:16:08 Info][Item] ActorEventCoordinator::sendActorCarriedItemChanged actor: , previouslyCarriedItem: 0 x (0)@0, carriedItem: 1 x 弓(300)@0, hand: 0");
    },
                    200);
}
#include <MC/I18n.hpp>
void printActorCategory()
{
    auto& entityTypeMap = *(std::unordered_map<enum class ActorType2, struct ActorMapping>*)dlsym("?ENTITY_TYPE_MAP@@3V?$unordered_map@W4ActorType@@UActorMapping@@U?$hash@W4ActorType@@@std@@U?$equal_to@W4ActorType@@@4@V?$allocator@U?$pair@$$CBW4ActorType@@UActorMapping@@@std@@@4@@std@@A");
    std::map<enum class ActorType2, struct ActorMapping> sortedMap;
    std::transform(entityTypeMap.begin(), entityTypeMap.end(), std::inserter(sortedMap, sortedMap.begin()),
                   [](std::pair<enum class ActorType2, struct ActorMapping> a) { return std::pair<enum class ActorType2, struct ActorMapping>(a.first, a.second); });
    logger.info("enum class ActorType2 : int {");
    for (auto& [type, mapping] : sortedMap)
    {
        auto currentLang = I18n::getCurrentLanguage().get();
        auto nameKey = fmt::format("%entity.{}.name", mapping.mName);
        auto trName = I18n::get(nameKey, currentLang);
        logger.info("                           \r    {:21s} = 0x{:08X}, // fullname: {}, 翻译: {}",
                    Util::toCamelCase("m_" + mapping.getMappingName((ActorTypeNamespaceRules)0), '_').substr(1),
                    (int)type,
                    mapping.getMappingName((ActorTypeNamespaceRules)1),
                    trName
                    //,mapping.mAlias
        );
    }
    logger.info("};");

    SymCall("?entityCategoryFromString@@YA?AW4ActorCategory@@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@Z", void, std::string const&)("none");
    //((void (*)(std::string const&))(       0x1421C8AD4 -        0x141F4EA20 + (uintptr_t)ptr))("none");
    auto tmpPtr = dlsym("?mFeatureToggles@FeatureToggles@@0V?$unique_ptr@VFeatureToggles@@U?$default_delete@VFeatureToggles@@@std@@@std@@A");
    auto& categoryMap = *(std::unordered_map<std::string, enum class ActorCategory2>*)((uintptr_t)16 + (uintptr_t)tmpPtr);
    logger.info("enum class ActorCategory2 : int {");
    for (auto& [name, category] : categoryMap)
    {
        logger.info("    {} = 0x{:06X},", Util::toCamelCase("m_" + name, '_').substr(1), (int)category);
    }
    logger.info("};");
}

template <>
LoopbackPacketSender* Global<LoopbackPacketSender>;
TInstanceHook(LoopbackPacketSender*, "??0LoopbackPacketSender@@QEAA@EAEAVNetworkHandler@@@Z",
              LoopbackPacketSender, unsigned char unk, class NetworkHandler& handler)
{
#ifdef PRINT_ENUM
    testDataItem();
    Schedule::delay(
        []() {
            printActorCategory();
        },
        50);
#endif // DEBUG

    Global<LoopbackPacketSender> = this;
    return original(this, unk, handler);
}

class SynchedActorData
{
public:
    //using DataList = std::vector<std::unique_ptr<DataItem>>;
    std::vector<std::unique_ptr<DataItem>> mItemsArray; //0
private:
    unsigned short mMinDirtyId; //24
    unsigned short mMaxDirtyId; //26
public:
    template <typename T>
    MCAPI void define(unsigned short, T const&);
    template <typename T>
    MCAPI void set(unsigned short, T const&);
    inline std::vector<std::unique_ptr<DataItem>>& getItemArray()
    {
        return mItemsArray;
    }

public:
    MCAPI SynchedActorData();
    MCAPI class SynchedActorData _clone() const;
    MCAPI bool assignValues(std::vector<std::unique_ptr<class DataItem>> const&, class Actor*);
    MCAPI void forEachDataItem(class std::function<void(std::unique_ptr<class DataItem> const&)> const&) const;
    MCAPI class CompoundTag const& getCompoundTag(unsigned short) const;
    MCAPI float getFloat(unsigned short) const;
    MCAPI int getInt(unsigned short) const;
    MCAPI __int64 getInt64(unsigned short) const;
    MCAPI signed char getInt8(unsigned short) const;
    MCAPI class BlockPos getPos(unsigned short) const;
    MCAPI short getShort(unsigned short) const;
    MCAPI std::string const& getString(unsigned short) const;
    MCAPI unsigned __int64 getValidDataItemCount() const;
    MCAPI class Vec3 getVec3(unsigned short) const;
    MCAPI bool hasData(unsigned short) const;
    MCAPI void markDirty(unsigned short);
    MCAPI class SynchedActorData& operator=(class SynchedActorData&&);
    MCAPI std::vector<std::unique_ptr<class DataItem>> packAll() const;
    MCAPI std::vector<std::unique_ptr<class DataItem>> packDirty();
    MCAPI ~SynchedActorData();

protected:
private:
    MCAPI class DataItem* _find(unsigned short) const;
    MCAPI class DataItem& _get(unsigned short);
    MCAPI void _resizeToContain(unsigned short);
};


#pragma region SetActorDataPacket

// ============= SetActorDataPacket =============
class SetActorDataPacket : public Packet
{
public:
    ActorRuntimeID mRuntimeId;
    Tick mTick = {0};
    std::vector<std::unique_ptr<DataItem>> mDataItems; //64

public:
    /*0*/ virtual ~SetActorDataPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI SetActorDataPacket(class ActorRuntimeID, class SynchedActorData&, bool);
    MCAPI SetActorDataPacket();
};

static_assert(offsetof(SetActorDataPacket, mDataItems) == 64);

#pragma endregion

#pragma region AddActorPacket

// ============= AddActorPacket =============
class AttributeInstanceHandle
{
    unsigned int mAttributeID;
    BaseAttributeMap* mAttributeMap;

public:
    MCAPI class AttributeInstance const& getInstance() const;
    MCAPI class AttributeInstance* getMutableInstance() const;
};
class BaseAttributeMap;
class AttributeInstance
{
public:
    BaseAttributeMap* mAttributeMap;                      //8
    Attribute* mAttribute;                                //16
    std::vector<AttributeModifier> mModifierList;         //24
    std::vector<TemporalAttributeBuff> mTemporalBuffs;    //48
    std::vector<AttributeInstanceHandle> mListeners;      //72
    std::shared_ptr<AttributeInstanceDelegate> mDelegate; //96
    float mDefaultMin;
    float mDefaultMax;
    float mDefaultValue;
    float mMinValue; //124
    float mMaxValue;
    float mCurrentValue;

public:
    /*0*/ virtual ~AttributeInstance();
    /*1*/ virtual void tick();
    MCAPI AttributeInstance(class AttributeInstance const&);
    MCAPI AttributeInstance();
    MCAPI void addBuff(class AttributeBuff const&);
    MCAPI void addModifier(class AttributeModifier const&);
    MCAPI void addModifier(class std::shared_ptr<class AttributeModifier>);
    MCAPI class Attribute const* getAttribute() const;
    MCAPI std::vector<class TemporalAttributeBuff> const& getBuffs() const;
    MCAPI float getCurrentValue() const;
    MCAPI float getDefaultValue(int) const;
    MCAPI class AttributeInstanceHandle getHandle() const;
    MCAPI std::vector<class AttributeInstanceHandle> const& getListeners() const;
    MCAPI float getMaxValue() const;
    MCAPI float getMinValue() const;
    MCAPI class AttributeModifier getModifier(class mce::UUID const&) const;
    MCAPI std::vector<class AttributeModifier> getModifiers(int) const;
    MCAPI std::vector<class AttributeModifier> getModifiers() const;
    MCAPI bool hasModifier(class mce::UUID const&) const;
    MCAPI bool hasModifier(class std::shared_ptr<class AttributeModifier>) const;
    MCAPI bool hasModifiers() const;
    MCAPI bool hasTemporalBuffs() const;
    MCAPI bool isValid() const;
    MCAPI void notify(__int64);
    MCAPI void recalculateModifiers();
    MCAPI void registerListener(class AttributeInstance const&);
    MCAPI void removeBuff(class std::shared_ptr<class AttributeBuff>);
    MCAPI void removeBuffs();
    MCAPI void removeModifier(class AttributeModifier const&);
    MCAPI void removeModifier(class std::shared_ptr<class AttributeModifier>);
    MCAPI bool removeModifier(class mce::UUID const&);
    MCAPI void resetToDefaultValue();
    MCAPI void resetToMaxValue();
    MCAPI void resetToMinValue();
    MCAPI void serializationSetRange(float, float, float);
    MCAPI void serializationSetValue(float, int, float);
    MCAPI void setCurrentValue(float);
    MCAPI void setDefaultValue(float, int);
    MCAPI void setDefaultValueOnly(float);
    MCAPI void setDelegate(class std::shared_ptr<class AttributeInstanceDelegate>);
    MCAPI void setMaxValue(float);
    MCAPI void setRange(float, float, float);
};
static_assert(offsetof(AttributeInstance, mMinValue) == 124);
class SyncedAttribute
{
    std::string mName;
    float mMinValue;
    float mCurrentValue;
    float mMaxValue;
    float mDefaultValue;
};
struct ActorLink
{
    unsigned char mType;
    ActorUniqueID mRiddenUniqueID;
    ActorUniqueID mRidderUniqueID;
    bool mImmediate;
    bool mRiderInitiated;
};
static_assert(sizeof(SyncedAttribute) == 48); //sizeof(NpcCommandAction::SavedCommand)
class AddActorPacket : public Packet
{
public:
    std::vector<struct ActorLink> mActorLinks; //48
    Vec3 mPosition;                            //72
    Vec3 mVelocity;                            //84
    float mPitch;                              //96
    float mYaw;                                //100
    float mHeadYaw;                            //104

    ActorUniqueID mUniqueId;                                //112
    ActorRuntimeID mRuntimeId;                              //120
    SynchedActorData* mActorData;                           //128, only for write
    std::vector<std::unique_ptr<DataItem>> mDataItems;      //136, only for read
    ActorDefinitionIdentifier mType;                        //160
    std::vector<AttributeInstanceHandle> mAttributeHandles; //336
    std::vector<SyncedAttribute> mAttributes;               //360

public:
    /*0*/ virtual ~AddActorPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AddActorPacket(class Actor&);
    MCAPI AddActorPacket();
    void fakeWrite(class BinaryStream& bs) const
    {
        bs.writeVarInt64(mUniqueId.id);
        bs.writeUnsignedVarInt64(mRuntimeId.id);
        bs.writeString(mType.getCanonicalName());
        bs.writeType(mPosition);
        bs.writeType(mVelocity);
        bs.writeFloat(mPitch);
        bs.writeFloat(mYaw);
        bs.writeFloat(mHeadYaw);
        //writeAtrribute
        bs.writeUnsignedVarInt((int)mAttributeHandles.size());
        for (auto& handle : mAttributeHandles)
        {
            auto& ins = handle.getInstance();
            bs.writeString(ins.getAttribute()->getName().getString());
            bs.writeFloat(ins.getMinValue());
            bs.writeFloat(ins.getCurrentValue());
            bs.writeFloat(ins.getMaxValue());
        }
        //writeDataItems
        auto dataItems = mActorData->packAll();
        auto actor = Global<Level>->getRuntimeEntity(mRuntimeId, true);
        auto fakeName = getActorFakeName(actor);
        dataItems.emplace_back(DataItem::create(ActorDataIDs::NAMETAG, fakeName));
        dataItems.emplace_back(DataItem::create<signed char>(ActorDataIDs::ALWAYS_SHOW_NAMETAG, true));
        bs.writeType(dataItems);

        //writeLinks
        bs.writeUnsignedVarInt((int)mActorLinks.size());
        for (auto& link : mActorLinks)
        {
            bs.writeVarInt64(link.mRiddenUniqueID.id);
            bs.writeVarInt64(link.mRidderUniqueID.id);
            bs.writeUnsignedChar(link.mType);
            bs.writeBool(link.mImmediate);
            bs.writeBool(link.mRiderInitiated);
        }
    }
};
static_assert(sizeof(AddActorPacket) == 384);
static_assert(offsetof(AddActorPacket, mActorLinks) == 48);
static_assert(offsetof(AddActorPacket, mHeadYaw) == 104);
static_assert(offsetof(AddActorPacket, mRuntimeId) == 120);
static_assert(offsetof(AddActorPacket, mType) == 160);
static_assert(offsetof(AddActorPacket, mAttributeHandles) == 336);

#pragma endregion

#pragma region AddItemActorPacket

// ============= AddItemActorPacket =============
class AddItemActorPacket : public Packet
{
public:
    std::vector<std::unique_ptr<DataItem>> mDataItems; //unk
    SynchedActorData* mActorData;                      //72
    ActorUniqueID mUniqueId;                           //80
    ActorRuntimeID mRuntimeId;                         //88
    NetworkItemStackDescriptor mDescriptor;            //96
    Vec3 mPos;                                         //224
    Vec3 mVelocity;                                    //236
    bool mIsFromFishing;                               //

public:
    /*0*/ virtual ~AddItemActorPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AddItemActorPacket(class ItemActor&);
    MCAPI AddItemActorPacket();
    void fakeWrite(class BinaryStream& bs) const
    {
        bs.writeVarInt64(mUniqueId.id);
        bs.writeUnsignedVarInt64(mRuntimeId.id);
        bs.writeType(mDescriptor);
        bs.writeType(mPos);
        bs.writeType(mVelocity);
        auto dataItems = mActorData->packAll();
        auto actor = Global<Level>->getRuntimeEntity(mRuntimeId, true);
        auto fakeName = getActorFakeName(actor);
        dataItems.emplace_back(DataItem::create(ActorDataIDs::NAMETAG, fakeName));
        dataItems.emplace_back(DataItem::create<signed char>(ActorDataIDs::ALWAYS_SHOW_NAMETAG, true));
        bs.writeType(dataItems);

        bs.writeBool(mIsFromFishing);
    }
};
static_assert(offsetof(AddItemActorPacket, mActorData) == 72);
static_assert(sizeof(ItemStackNetIdVariant) == 24);
static_assert(sizeof(AddItemActorPacket) == 280);

#pragma endregion

#pragma region AddPaintingPacket

// ============= AddPaintingPacket =============
class AddPaintingPacket : public Packet
{
    ActorUniqueID mUniqueId;   //48
    ActorRuntimeID mRuntimeId; //56
    Vec3 mPos;                 //64
    int mDirection;            //72
    std::string mMotive;       //80

public:
    /*0*/ virtual ~AddPaintingPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AddPaintingPacket(class Painting const&);
    MCAPI AddPaintingPacket();
    void fakeWrite(class BinaryStream& bs) const
    {
        bs.writeVarInt64(mUniqueId.id);
        bs.writeUnsignedVarInt64(mRuntimeId.id);
        bs.writeType(mPos);
        bs.writeVarInt(mDirection);
        bs.writeString(mMotive);
    }
};

#pragma endregion

#pragma region AddPlayerPacket

// ============= AddPlayerPacket =============
class Ability
{
    enum Options : unsigned char;
    enum Type;

    Type mType;
    int mValue;
    Options mOptions;
};
class Abilities
{
    std::unique_ptr<class PermissionsHandler> mPermissions;
    std::array<Ability, 18> mAbilities;
    std::array<Ability, 18> mCustomAbilityCache;
    int unk320;
    int unk324;
    int unk328;

public:
    MCAPI Abilities(class Abilities const&);
    MCAPI Abilities();
    MCAPI void addSaveData(class CompoundTag&) const;
    MCAPI void forEachAbility(class std::function<void(class Ability&, char const*)> const&, enum Ability::Options);
    MCAPI class Ability& getAbility(enum AbilitiesIndex);
    MCAPI class Ability const& getAbility(enum AbilitiesIndex) const;
    MCAPI bool getBool(enum AbilitiesIndex) const;
    MCAPI enum CommandPermissionLevel getCommandPermissions() const;
    MCAPI class Ability const& getCustomAbilityFromCache(enum AbilitiesIndex) const;
    MCAPI class Ability& getCustomAbilityFromCache(enum AbilitiesIndex);
    MCAPI enum PlayerPermissionLevel getPlayerPermissions() const;
    MCAPI bool isFlying() const;
    MCAPI bool loadSaveData(class CompoundTag const&);
    MCAPI class Abilities& operator=(class Abilities const&);
    MCAPI void setAbility(enum AbilitiesIndex, bool);
    MCAPI void setAbilityDiff(enum AbilitiesIndex, bool, bool&);
    MCAPI void setCommandPermissions(enum CommandPermissionLevel);
    MCAPI void setPlayerPermissions(enum PlayerPermissionLevel);
    MCAPI ~Abilities();
    MCAPI static char const* getAbilityName(enum AbilitiesIndex);
    MCAPI static enum AbilitiesIndex nameToAbilityIndex(std::string const&);

protected:
private:
    MCAPI void _registerAbilities();
    MCAPI static class std::array<char const*, 18> ABILITY_NAMES;
    MCAPI static std::string const TAG;
};
//static_assert(sizeof(Abilities) == 336);
struct AdventureSettings
{
    char filler[26];

public:
    MCAPI AdventureSettings();
};
class AdventureSettingsPacket : public Packet
{
    char filler[80 - sizeof(Packet)];

public:
    /*0*/ virtual ~AdventureSettingsPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AdventureSettingsPacket(struct AdventureSettings const&, class Abilities const&, struct ActorUniqueID, bool);
};
class AddPlayerPacket : public Packet
{
public:
    std::vector<struct ActorLink> mActorLinks;         //48
    std::string mName;                                 //72
    mce::UUID mUuid;                                   //104
    ActorUniqueID mUniqueId;                           //120
    ActorRuntimeID mRuntimeId;                         //128
    std::string mPlatformOnlineId;                     //136
    Vec3 mPosition;                                    //168
    Vec3 mVelocity;                                    //180
    float mPitch;                                      //192
    float mYaw;                                        //196
    float mHeadYaw;                                    //200
    std::vector<std::unique_ptr<DataItem>> mDataItems; //208, only for deserialize
    Abilities mAbilities;                              //232
    std::string mDeviceId;                             //688
    enum BuildPlatform mBuildPlatform;                 //720
    char pad_604[4];                                   //604
    NetworkItemStackDescriptor mCarriedItem;           //728
    SynchedActorData* mActorData;                      //880
public:
    /*0*/ virtual ~AddPlayerPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*4*/ virtual bool disallowBatching() const;
    /*5*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    MCAPI AddPlayerPacket(class Player&);
    MCAPI AddPlayerPacket();
    void fakeWrite(class BinaryStream& bs) const
    {
        bs.writeUnsignedInt64(*(unsigned __int64*)&mUuid);
        bs.writeUnsignedInt64(*((unsigned __int64*)&mUuid + 1));
        bs.writeString(getActorFakeName(Global<Level>->getRuntimeEntity(mRuntimeId, true)));
        bs.writeVarInt64(mUniqueId.id);
        bs.writeUnsignedVarInt64(mRuntimeId.id);
        bs.writeString(mPlatformOnlineId);
        bs.writeType(mPosition);
        bs.writeType(mVelocity);
        bs.writeFloat(mPitch);
        bs.writeFloat(mYaw);
