#include "pch.h"
#include <mc/OffsetHelper.h>
#include "EnumGen.h"
#include "SymHelper.h"
#include "StrHelper.h"
#include <nbt-from-lxl/NBT.h>
#include <mc/Item.h>
//#include <wangheader/HumanoidMonster.hpp>
//#include <wangheader/MobEffect.hpp>
#include <lbpch.h>
using namespace std;

/*
ItemAcquisitionMethod
unordered_map<enum ItemAcquisitionMethod, enum MinecraftEventing::AcquisitionMethod> const MinecraftEventing::mAcquisitionMethodMap
?mAcquisitionMethodMap@MinecraftEventing@@0V?$unordered_map@W4ItemAcquisitionMethod@@W4AcquisitionMethod@MinecraftEventing@@U?$hash@W4ItemAcquisitionMethod@@@std@@U?$equal_to@W4ItemAcquisitionMethod@@@5@V?$allocator@U?$pair@$$CBW4ItemAcquisitionMethod@@W4AcquisitionMethod@MinecraftEventing@@@std@@@5@@std@@B

ItemUseMethod
unordered_map<enum ItemUseMethod, enum MinecraftEventing::UseMethod> const MinecraftEventing::mUseMethodMap
?mUseMethodMap@MinecraftEventing@@0V?$unordered_map@W4ItemUseMethod@@W4UseMethod@MinecraftEventing@@U?$hash@W4ItemUseMethod@@@std@@U?$equal_to@W4ItemUseMethod@@@5@V?$allocator@U?$pair@$$CBW4ItemUseMethod@@W4UseMethod@MinecraftEventing@@@std@@@5@@std@@B dd?

STRING_TO_CONTENT_TYPE
unordered_map<string, enum EducationMetadata::ContentType> const EducationMetadata::STRING_TO_CONTENT_TYPE

.data:00007FF6B0F04C38 ?mEnchantmentNames@EnchantUtils@@0V?$vector@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$allocator@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@@std@@A xmmword ?

.data:00007FF6B0F39928 ; private: static class std::vector<class PotionBrewing::Ingredient, class std::allocator<class PotionBrewing::Ingredient>> PotionBrewing::mValidContainers
.data:00007FF6B0F39928 ?mValidContainers@PotionBrewing@@0V?$vector@VIngredient@PotionBrewing@@V?$allocator@VIngredient@PotionBrewing@@@std@@@std@@A

.data:00007FF6B0F485D0 ; private: static class std::vector<enum ActorDamageCause, class std::allocator<enum ActorDamageCause>> const ShieldItemUtils::mAlwaysBlockableDamageCauses
.data:00007FF6B0F485D0 ?mAlwaysBlockableDamageCauses@ShieldItemUtils@@0V?$vector@W4ActorDamageCause@@V?$allocator@W4ActorDamageCause@@@std@@@std@@B

?playerPermissionLevelToString@PermissionsHandler@@SA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@AEBW4PlayerPermissionLevel@@@Z

; public: static class std::vector<class Motive const *, class std::allocator<class Motive const *>> Motive::getAllMotivesAsList(void)
?getAllMotivesAsList@Motive@@SA?AV?$vector@PEBVMotive@@V?$allocator@PEBVMotive@@@std@@@std@@XZ proc near

.data:00007FF6B0E78A70 ; __int64 ItemStack::EMPTY_ITEM[17]
.data:00007FF6B0E78A70 ?EMPTY_ITEM@ItemStack@@2V1@B dq ?       ; DATA XREF: _dynamic_initializer_for__ItemStack__EMPTY_ITEM__+4↑o


.data:00007FF6B0EEA330 ; void *BlockTypeRegistry::mBlockLookupMap
.data:00007FF6B0EEA330 ?mBlockLookupMap@BlockTypeRegistry@@0V?$map@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$SharedPtr@VBlockLegacy@@@@U?$less@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@V?$allocator@U?$pair@$$CBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$SharedPtr@VBlockLegacy@@@@@std@@@2@@std@@A dq ?

.data:00007FF6B0EEA340 ; struct EntityRegistryOwned *BlockTypeRegistry::mEntities
.data:00007FF6B0EEA340 ?mEntities@BlockTypeRegistry@@0V?$OwnerPtrT@UEntityRegistryRefTraits@@@@A dq ?


lookupActualEntityType
BiomeRegistry::lookupById
 BlockTypeRegistry::lookupByName

*/

#define LOG_VAR(var) std::cout << #var" :\t" << var << std::endl;

#define ITER_TYPE_MAP(typeMap) \
for (auto& [type, name] : typeMap) {\
cout << "    " << name << " = " << (int)type << "," << endl;\
}\

namespace I18n {
    string get(string const& key) {
        string str;
        return SymCall("?get@I18n@@SA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@AEBV23@@Z",
            string&, string&, string const&)(str, key);
    }
    string get(string const& key, vector<string>& var) {
        string str;
        return SymCall("?get@I18n@@SA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@AEBV23@AEBV?$vector@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$allocator@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@@3@@Z",
            string&, string&, string const&, vector<string>&)(str, key, var);
    }
}

struct voids {
    void***** v[1000];
};

short getBlockItemId(BlockLegacy* bll) {
    return SymCall("?getBlockItemId@BlockLegacy@@QEBAFXZ", short, BlockLegacy*)(bll);
}

BlockLegacy* getFromWeakPtr(void* weakptr) {
    return SymCall("?get@?$WeakPtr@VBlockLegacy@@@@QEBAPEAVBlockLegacy@@XZ", BlockLegacy*, void*)(weakptr);
}
Block* getBlockFromLegacy(BlockLegacy* bl) {
    return SymCall("?getRenderBlock@BlockLegacy@@UEBAAEBVBlock@@XZ", Block*, BlockLegacy*)(bl);
}

void genBlockType() {
    uintptr_t weakPtrBlockLegacyStart = (uintptr_t)dlsym("?mAir@BedrockBlockTypes@@3V?$WeakPtr@VBlockLegacy@@@@A");
    uintptr_t weakPtrBlockLegacyEnd = (uintptr_t)dlsym("?mSculkShrieker@VanillaBlockTypes@@3V?$WeakPtr@VBlockLegacy@@@@A");
    size_t size = sizeof(weakPtrBlockLegacyStart);
    std::cout << "enum BlockType : short{" << std::endl;
    for (uintptr_t ptr = weakPtrBlockLegacyStart; ptr <= weakPtrBlockLegacyEnd; ptr += size) {
        auto blockLegacy = getFromWeakPtr((void*)ptr);
        if (!blockLegacy) {
            //cout << (ptr - weakPtrBlockLegacyStart) / 8 << endl;
            continue;
        }
        auto blockName = offBlockLegacy::getFullName(blockLegacy);
        auto blockItemId = getBlockItemId(blockLegacy);
        auto block = getBlockFromLegacy(blockLegacy);
        auto offset = (ptr - weakPtrBlockLegacyStart) / 8;
        string tmp = "m_" + blockName.substr(blockName.find(':') + 1);
        auto enumName = StrHelper::toCamelCase(tmp);
        //LOG_VAR(blockName)
        //LOG_VAR(blockItemId)
        //LOG_VAR(offset)
        std::cout << "    " << enumName << " = " << blockItemId << ", // " << blockName << std::endl;
    }
    std::cout << "};" << std::endl;
}

void genItemStackRequestActionType() {
    auto actionTypeMap = (unordered_map<char, string>*)dlsym("?actionTypeMap@ItemStackRequestAction@@0V?$BidirectionalUnorderedMap@W4ItemStackRequestActionType@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@@B");
    
    cout << "enum ItemStackRequestActionType : char {" << endl;
    ITER_TYPE_MAP(*actionTypeMap);
    cout << "};" << endl;
}

void genComplexInventoryTransactionType() {
    auto transactionTypeMap = (unordered_map<char, string>*)dlsym("?transactionTypeMap@ComplexInventoryTransaction@@0V?$BidirectionalUnorderedMap@W4Type@ComplexInventoryTransaction@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@@B");

    cout << "enum ComplexInventoryTransactionType : unsigned int {" << endl;
    ITER_TYPE_MAP(*transactionTypeMap)
    cout << "};" << endl;
}

void genContainerType() {
    auto containerTypeMap = (unordered_map<char, string>*)dlsym("?containerTypeMap@Container@@1V?$BidirectionalUnorderedMap@W4ContainerType@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@@B");

    cout << "enum class ContainerType : char {" << endl;
    ITER_TYPE_MAP(*containerTypeMap);
    cout << "};" << endl;
}

void genActorType() {
    string typeName;
    cout << "enum ActorType : unsigned short {" << endl;
    for (int t = 0; t < MAXUINT16; t++) {
        string entityType;
        string nameSpace;
        SymCall("?EntityTypeToStringAndNamespace@@YAXW4ActorType@@AEAV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@1@Z",
            void, unsigned short, string&, string&)(t, entityType, nameSpace);
        if (entityType != "unknown")
            cout << "    " << entityType << " = " << t << ", // " << nameSpace << ":" << entityType << endl;
    }
    cout << "};" << endl;
}

void genItemStackNetResult() {
    auto itemStackNetResultMap = (unordered_map<char, string>*)dlsym("?mMap@ItemStackNetResultMap@@0V?$BidirectionalUnorderedMap@W4ItemStackNetResult@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@@B");

    cout << "enum ItemStackNetResult : char {" << endl;
    ITER_TYPE_MAP(*itemStackNetResultMap);
    cout << "};" << endl;
}

void genContainerCollectionNameMap() {
    auto containerNameMap = (unordered_map<char, string>*)dlsym("?ContainerCollectionNameMap@@3V?$unordered_map@W4ContainerEnumName@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@UContainerEnumNameHasher@@U?$equal_to@W4ContainerEnumName@@@3@V?$allocator@U?$pair@$$CBW4ContainerEnumName@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@std@@@3@@std@@A");

    cout << "enum ContainerCollectionNameMap : char {" << endl;
    for (auto& ctn : *containerNameMap) {
        string enumName = StrHelper::toCamelCase(ctn.second);
        cout << "    " << enumName << " = " << (int)ctn.first << ", //" << ctn.second << endl;
    }
    cout << "};" << endl;
}
void genContainerOffset() {
    auto containerNameMap = (unordered_map<char, string>*)dlsym("?ContainerCollectionNameMap@@3V?$unordered_map@W4ContainerEnumName@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@UContainerEnumNameHasher@@U?$equal_to@W4ContainerEnumName@@@3@V?$allocator@U?$pair@$$CBW4ContainerEnumName@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@std@@@3@@std@@A");

    cout << "enum ContainerOffset : char {" << endl;
    for (auto& ctn : *containerNameMap) {
        string enumName = StrHelper::toCamelCase(ctn.second);
        char fakeContainer[49] = {};
        fakeContainer[48] = ctn.first;
        char offset = SymCall("?_getContainerOffset@PlayerUIContainerModel@@MEBAHXZ", char, void*)((void*)fakeContainer);
        if(offset)
            cout << "    " << enumName << " = " << (int)offset << ", //" << ctn.second << endl;
    }
    cout << "};" << endl;
}

void genLegacyIDToNameMap() {
    auto containerNameMap = (unordered_map<short, HashedString>*)dlsym("?mLegacyIDToNameMap@ItemRegistry@@0V?$unordered_map@FVHashedString@@U?$hash@F@std@@U?$equal_to@F@3@V?$allocator@U?$pair@$$CBFVHashedString@@@std@@@3@@std@@A");

    cout << "enum LegacyIDToNameMap : char {" << endl;
    for (auto& ctn : *containerNameMap)
        cout << "    " << ctn.second.getString() << " = " << (int)ctn.first << "," << endl;
    cout << "};" << endl;
}

void genParticleType() {
    auto particleTypeMap = (unordered_map<char, string>*)dlsym("?map@ParticleTypeMap@@0V?$BidirectionalUnorderedMap@W4ParticleType@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@@B");

    cout << "enum class ParticleType : unsigned int {" << endl;
    ITER_TYPE_MAP(*particleTypeMap);
    cout << "};" << endl;
}

void genBlockActorType() {
    cout << "enum BlockActorType : char {" << endl;
    auto nameIdMap = (map<int, string>*)dlsym("?mClassIdMap@BlockActor@@0V?$map@W4BlockActorType@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@U?$less@W4BlockActorType@@@3@V?$allocator@U?$pair@$$CBW4BlockActorType@@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@std@@@3@@std@@B");
    auto idNameMap = (map<string, int>*)dlsym("?mIdClassMap@BlockActor@@0V?$map@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@W4BlockActorType@@U?$less@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@V?$allocator@U?$pair@$$CBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@W4BlockActorType@@@std@@@2@@std@@B");

    for (auto& mapIter : *nameIdMap) {
        if (idNameMap->at(mapIter.second) != mapIter.first)
            cout << "Error: " << endl;
        cout << "    " << mapIter.second << " = " << (int)mapIter.first << "," << endl;
    }
    cout << "};" << endl;
}


//void genJigsawStructureMap() {
//    cout << "enum JigsawStructureMap : char {" << endl;
//    auto man= SymCall("?getJigsawStructureRegistry@Level@@UEBAAEBVJigsawStructureRegistry@@XZ",
//        void*, Level*)(getLevel());
//    auto ele = SymCall("?getJigsawStructureElementRegistry@JigsawStructureRegistry@@QEAAAEAVJigsawStructureElementRegistry@@XZ",
//        void*, void*)(man);
//    auto nameIdMap = dAccess< map<string, int>*>(ele, 24);
//
//    for (auto& mapIter : *nameIdMap)
//        cout << "    " << mapIter.first << " = " << (int)mapIter.second << "," << endl;
//    cout << "};" << endl;
//}


void genEnchantType() {
    cout << "enum EnchantType : char {" << endl;
    //auto mEnchantmentNames = (vector<string>*)dlsym(
    //    "?mEnchantmentNames@EnchantUtils@@0V?$vector@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$allocator@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@@std@@A"
    //);
    //for (auto& name : *mEnchantmentNames) {
    //    auto hname = HashedString(name.c_str());
    //    char id = SymCall("?getEnchantmentId@EnchantUtils@@SA?AW4Type@Enchant@@AEBVHashedString@@@Z",
    //        char, HashedString&)(hname);
    //    cout << "    " << name << " = " << (int)id << "," << endl;
    //}
    class Enchant {
    public:
        char type; //8
        //char filler[3]; //9
        int frequency; //12
        char isLootable; //16
        //char filler2[3];
        int primarySlots; //20
        int secondarySlots; //24
        int maxLevel; //28
        string stringId; //32
        HashedString description; //64
        char isAvailable; //112

        virtual ~Enchant()=0;
        virtual bool isCompatibleWith(int /*enum Enchant::Type*/) = 0;
        virtual int getMinCost(int) = 0;
        virtual int getMaxCost(int) = 0;
        // {bedrock_server_mod.exe!`anonymous namespace'::availableSetCountOfOne(void)}
        virtual void* availableSetCountOfOne() = 0;
        virtual int getMaxLevel(void) = 0;
        virtual int getDamageProtection(int, class ActorDamageSource const&) = 0;
        virtual float getDamageBonus(int, class Actor const&) = 0;
        virtual void doPostAttack(class Actor&, class Actor&, int) = 0;
        virtual void doPostHurt(class ItemInstance&, class Actor&, class Actor&, int) = 0;
        virtual void unk_vfn_10() = 0;
        virtual void unk_vfn_11() = 0;
        virtual void unk_vfn_12() = 0;
        virtual void unk_vfn_13() = 0;
        virtual bool _isValidEnchantmentTypeForCategory(int /*enum Enchant::Type*/) = 0;

        string getDisplayName() {
            return I18n::get(stringId);
        }
    };
    auto mEnchantments = (vector<unique_ptr<Enchant>>*)dlsym(
        "?mEnchants@Enchant@@2V?$vector@V?$unique_ptr@VEnchant@@U?$default_delete@VEnchant@@@std@@@std@@V?$allocator@V?$unique_ptr@VEnchant@@U?$default_delete@VEnchant@@@std@@@std@@@2@@std@@A"
    );
    //cout << "type,frequency,isLootable,primarySlots,secondarySlots,maxLevel,stringId,description,isAvailable" << endl;
    for (auto& enptr : *mEnchantments) {
        Enchant* ench = enptr.get();
        string enumName = StrHelper::toCamelCase("m_" + ench->description.getString()).substr(1);
        cout << "    " << enumName << " = " << (int)ench->type << ", //"
            << "maxLevel: " << ench->getMaxLevel()
            << ", frequency: " << ench->frequency
            << ", name: " << ench->getDisplayName()
            << ", description: " << ench->description.getString()
            << endl;
        //cout << (int)ench->type << "," << ench->frequency << "," << (int)ench->isLootable << ","
        //    << ench->primarySlots << "," << ench->secondarySlots << "," << ench->getMaxLevel() << "," 
        //    << ench->getDisplayName() << "," << ench->description.getString() << "," << (int)ench->isAvailable << endl;
    }
    cout << "};" << endl;
}


void genEffectType() {
    class MobEffect {
    public:
        struct FactorCalculationData {
            bool padding_duration;
            float factor_target;//4
            int factor_current;//8
            char filler[80 - 12];//12
            int change_timestamp;//80
            float factor_previous;//84
            bool had_last_tick;//88
            bool had_applied;//89
            Tag* save() {
                Tag* tag = Tag::createTag(TagType::Compound);
                SymCall("?save@FactorCalculationData@MobEffect@@QEBA?AV?$unique_ptr@VCompoundTag@@U?$default_delete@VCompoundTag@@@std@@@std@@XZ",
                    Tag**, FactorCalculationData*, Tag**)(this, &tag);
                return tag;
            }
        };
        int id; // 8
        bool isHarmful; //12
        float colorR;//16
        float colorG;//20
        float colorB;//24
        int unk28;//28, 0x3f800000
        string locName;//32
        int icon;//64
        float durationModifier;//isHarmful?0.5:1.0
        char unk72;
        string resourceName;//80
        string iconName;//112
        void* unk144;
        HashedString componentName;//152
        shared_ptr<class Amplifier> valueAmplifier;//200
        shared_ptr<Amplifier> durationAmplifier;//216
        vector<pair<class Attribute const*, shared_ptr<class AttributeBuffer>>> attributeBuffs;//232
        vector<pair<Attribute*, shared_ptr<class AttributeModifier>>> attributeModifiers;//256
        FactorCalculationData fcd;//280

        virtual ~MobEffect()=0;
        virtual void applyEffects(Actor*, int, int) = 0;
        virtual void removeEffects(Actor*) = 0;
        virtual void applyInstantaneousEffect(Actor*, Actor*, Actor*, int, float) = 0;
        virtual void unk_vfn_4() = 0;
        virtual float getAttributeModifierValue(int, class AttributeModifier const&) = 0;

        string getDisplayName() {
            return I18n::get(locName);
        }
    };//376

    auto mMobEffects = (MobEffect**)dlsym("?mMobEffects@MobEffect@@2PAV?$unique_ptr@VMobEffect@@U?$default_delete@VMobEffect@@@std@@@std@@A");

    cout << "enum EffectType : short {" << endl;
    for (auto index = 0;;++index) {
        auto effect = mMobEffects[index];
        if (!effect)
            break;
        string enumName = StrHelper::toCamelCase("m_" + effect->resourceName).substr(1);
        string str = TagToSNBT(effect->fcd.save());
        cout << "    " << enumName << " = " << effect->id << ", //"
            //<< "componentName: " << effect->componentName.getString()
            << "resourceName: " << effect->resourceName
            << ", name: " << effect->getDisplayName()
            << endl;
    }
    cout << "};" << endl;
}

void genDamageCause() {
    cout << "enum ActorDagageCause : unsigned int {" << endl;
    for (unsigned int t = 0; t < MAXUINT16; t++) {
        auto& typeName = SymCall("?lookupCauseName@ActorDamageSource@@SAAEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@W4ActorDamageCause@@@Z",
            string&, unsigned int)(t);
        char newType = SymCall("?lookupCause@ActorDamageSource@@SA?AW4ActorDamageCause@@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@Z",
            char, string&)(typeName);
        if (t == newType)
            cout << "    " << typeName << " = " << (int)t << "," << endl;
    }
    cout << "};" << endl;
}

void genBlockGeometry() {
    cout << "enum BlockGeometry : unsigned int {" << endl;
    unordered_map<string, class BlockGraphics*> mBlockLookupMap = 
        *(unordered_map<string, class BlockGraphics*>*)dlsym(
        "?mBlockLookupMap@BlockGraphics@@2V?$unordered_map@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@PEAVBlockGraphics@@U?$hash@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@U?$equal_to@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@V?$allocator@U?$pair@$$CBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@PEAVBlockGraphics@@@std@@@2@@std@@A"
    );
    map<string, class Model*> mModels = *(map<string, class Model*>*)dlsym(
        "?mModels@BlockGraphics@@0V?$map@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$unique_ptr@UModel@BlockGeometry@@U?$default_delete@UModel@BlockGeometry@@@std@@@2@U?$less@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@V?$allocator@U?$pair@$$CBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$unique_ptr@UModel@BlockGeometry@@U?$default_delete@UModel@BlockGeometry@@@std@@@2@@std@@@2@@std@@A"
    );
    map<string, class TessellatedModel*> mTessellatedModels = *(map<string, class TessellatedModel*>*)dlsym(
        "?mTessellatedModels@BlockGraphics@@0V?$map@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$unique_ptr@VTessellatedModel@BlockGeometry@@U?$default_delete@VTessellatedModel@BlockGeometry@@@std@@@2@U?$less@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@V?$allocator@U?$pair@$$CBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$unique_ptr@VTessellatedModel@BlockGeometry@@U?$default_delete@VTessellatedModel@BlockGeometry@@@std@@@2@@std@@@2@@std@@A"
    );
    unordered_map<unsigned int, class BlockGraphics*> mBlocks = *(unordered_map<unsigned int, class BlockGraphics*>*)dlsym(
        "?mBlocks@BlockGraphics@@0V?$unordered_map@IPEAVBlockGraphics@@U?$hash@I@std@@U?$equal_to@I@3@V?$allocator@U?$pair@$$CBIPEAVBlockGraphics@@@std@@@3@@std@@A"
    );
    void** mTerrainTextureAtlas = (void**)dlsym(
        "?mTerrainTextureAtlas@BlockGraphics@@1V?$weak_ptr@VAtlasItemManager@@@std@@A"
    );


    cout << "};" << endl;
}

vector<string> getActorDebugText(Actor* actor) {
    vector<string> text;
    SymCall("?getDebugText@Actor@@UEAAXAEAV?$vector@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@V?$allocator@V?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@2@@std@@@Z",
        void, Actor*, vector<string>&)(actor, text);
    return text;
}

bool setStatusFlag(Actor* actor, int flag, bool val) {
    return SymCall("?setStatusFlag@Actor@@QEAA_NW4ActorFlags@@_N@Z",
        bool, Actor*, int, bool)(actor, flag, val);
}

void genActorFlags(Actor* actor) {
    cout << "enum class ActorFlags : int {" << endl;
    int flagMax = 97;
    for (int i = 0; i <= flagMax; ++i) {
        setStatusFlag(actor, i, false);
    }
    for (int i = 0; i <= flagMax; ++i) {
        if(i!=0)
            setStatusFlag(actor, i-1, false);
        setStatusFlag(actor, i, true);
        auto text = getActorDebugText(actor);
        if (text.size() < 6)
            continue;
        string flagName = text[5].substr(1);
        string enumName = StrHelper::toCamelCase("m_" + flagName).substr(1);
        //cout << "    " << camelName << " = " << (int)i << "," << endl;
        cout << "    {ActorFlags::" << flagName << ", \"" << flagName << "\"}," << endl;
    }
    cout << "};" << endl;
}

void genActorCategory() {
    SymCall("?entityCategoryFromString@@YA?AW4ActorCategory@@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@Z",
        int, string const&)("");
    auto tmp = dlsym("?mFeatureToggles@FeatureToggles@@0V?$unique_ptr@VFeatureToggles@@U?$default_delete@VFeatureToggles@@@std@@@std@@A");
    auto tmp2 = dlsym("?mMutex@?$ServiceLocator@VEducationOptions@@@@0Vshared_mutex@std@@A");
    auto offset = (uintptr_t)tmp2 - (uintptr_t)tmp;
    auto m = (unordered_map<string, int>*)((uintptr_t)tmp + 0x18);
    cout << m->size() << endl;
}

void genEnum()
{
    //genBlockType();
    //genItemStackRequestActionType();
    //genComplexInventoryTransactionType();
    //genContainerType();
    //genActorType();
    //genItemStackNetResult();
    //genContainerCollectionNameMap();
    //genContainerOffset();
    //genLegacyIDToNameMap();
    //genParticleType();
    //genBlockActorType();
    //genJigsawStructureMap(); //x
    genActorCategory();
    genEnchantType();
    genEffectType();
    //genDamageCause();
    genBlockGeometry();
}


/*
struct ItemDescriptor {
    void* weakptr_item;
    void* unk8;
    void* unk16;
    Block* block;
    int16_t aux;
    byte unk34; //vaild?
    byte unk35; //need _resolveImpl
    char unk36[4];
    string* unk40;
    void* unk48;
    void* unk56;
    int64_t unk64;//block 15,
    inline string getSerializedNameAndAux() {
        string name;
        return SymCall("?getSerializedNameAndAux@ItemDescriptor@@QEBA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@XZ",
            string&, ItemDescriptor*, string&)(this, name);
    }
};//72

typedef int ItemStackNetIdVariant;

struct NetworkItemStackDescriptor {
    ItemDescriptor descriptor;//16
    short unk88;//16+72=88
    char filler90[6];//90
    char unk96;//96
    char filler97[3];//97
    ItemStackNetIdVariant variant100;//100
    char filler104[4];
    int unk108;//108
    string unk112;//112
};

struct InventoryAction {
    int type;
    int unk4;
    int unk8;//8
    int unk12;//12

    NetworkItemStackDescriptor descriptor1;//16

    //ItemDescriptor descriptor;//16
    //short unk88;//16+72=88
    //char filler90[6];//90
    //char unk96;//96
    //char filler97[3];//97
    //ItemStackNetIdVariant variant100;//100
    //char filler104[4];
    //int unk108;//108
    //string unk112;//112

    NetworkItemStackDescriptor descriptor2;//144

    //ItemDescriptor descriptor2;//144
    //short unk216;//144+72=216
    //char filler218[6];//218
    //byte unk224;//224
    //char filler225[3];//225
    //ItemStackNetIdVariant unk228;//228
    //char filler232[4];
    //int unk236;//236
    //string unk240;//240

    ItemStack item1;//272
    void* unk408;
    ItemStack item2;//416
    void* unk552;
}; //560

string getString(void* source) {
    string str;
    return SymCall("?toString@InventorySource@@QEBA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@XZ",
        string&, void*, string&)(source, str);
}

THook(void, "?addAction@InventoryTransaction@@QEAAXAEBVInventoryAction@@@Z",
    class InventoryTransaction* _this, InventoryAction* action) {
    cout << action->type << endl;
    if(&action->item1)
    cout << "Item1: " << action->item1.toString() << endl;
    if (&action->item2)
    cout << "Item2: " << action->item2.toString() << endl;
    cout << endl;
    unordered_map<int, vector<InventoryAction>>& actions = dAccess<unordered_map<int, vector<InventoryAction>>,0>(_this);
    if (actions.size() > 0) {
        auto& b = actions.begin()->second;
    }
    if (action->type != 99999)
        return original(_this, action);
    original(_this, action);
}
*/

/*
THook(void, "??1SemVersion@@QEAA@XZ",void* _this){
